In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df= pd.read_csv("https://raw.githubusercontent.com/jessiececilya/ML-Data/main/titanic/test.csv")
df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

# Numpy Aggregate function

In [ ]:
np.mean(df['Fare'])

35.6271884892086

In [ ]:
np.ma.count(df['Embarked'])

418

In [ ]:
np.min(df['Fare'])

0.0

In [ ]:
df.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
df.count(axis=0)

PassengerId    418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

# Groupby

In [ ]:
df.groupby(['Pclass','Sex'],as_index=False).agg({'Sex':'count'})

   Pclass  Sex
0       1   50
1       1   57
2       2   30
3       2   63
4       3   72
5       3  146

In [ ]:
y=df.groupby(['Pclass'], as_index=False).count()
y

   Pclass  PassengerId  Name  Sex  Age  ...  Parch  Ticket  Fare  Cabin  Embarked
0       1          107   107  107   98  ...    107     107   107     80       107
1       2           93    93   93   88  ...     93      93    93      7        93
2       3          218   218  218  146  ...    218     218   217      4       218

[3 rows x 11 columns]

In [ ]:
df.groupby(['Pclass','Sex'],as_index=False).count()

   Pclass     Sex  PassengerId  Name  Age  ...  Parch  Ticket  Fare  Cabin  Embarked
0       1  female           50    50   48  ...     50      50    50     40        50
1       1    male           57    57   50  ...     57      57    57     40        57
2       2  female           30    30   29  ...     30      30    30      3        30
3       2    male           63    63   59  ...     63      63    63      4        63
4       3  female           72    72   50  ...     72      72    72      1        72
5       3    male          146   146   96  ...    146     146   145      3       146

[6 rows x 11 columns]

In [ ]:
df.groupby(['Pclass'],as_index=False).agg({'Age':'mean'})

   Pclass        Age
0       1  40.918367
1       2  28.777500
2       3  24.027945

# Pivot

In [ ]:
j=pd.pivot_table(df, index=['Pclass','Sex'], values=['Fare'],aggfunc=[np.mean, np.ma.count])
j

                     mean  count
                     Fare   Fare
Pclass Sex
1      female  115.591168   50.0
       male     75.586551   57.0
2      female   26.438750   30.0
       male     20.184654   63.0
3      female   13.735129   72.0
       male     11.826350  146.0

In [ ]:
j.columns

MultiIndex([( 'mean', 'Fare'),
            ('count', 'Fare')],
           )

In [ ]:
j['mean']['Fare']

Pclass  Sex
1       female    115.591168
        male       75.586551
2       female     26.438750
        male       20.184654
3       female     13.735129
        male       11.826350
Name: Fare, dtype: float64

# Filling NA

In [ ]:
df['Age']= df['Age'].fillna(df['Age'].mean())

In [ ]:
df['Age'].isna().sum()

0

In [ ]:
#using replace function
df['Cabin']= df['Cabin'].replace(np.nan, df['Cabin'].mode()[0])

In [ ]:
#dropping any na rows
df.dropna(axis=0, how='any')

     PassengerId  Pclass  ...            Cabin Embarked
0            892       3  ...  B57 B59 B63 B66        Q
1            893       3  ...  B57 B59 B63 B66        S
2            894       2  ...  B57 B59 B63 B66        Q
3            895       3  ...  B57 B59 B63 B66        S
4            896       3  ...  B57 B59 B63 B66        S
..           ...     ...  ...              ...      ...
413         1305       3  ...  B57 B59 B63 B66        S
414         1306       1  ...             C105        C
415         1307       3  ...  B57 B59 B63 B66        S
416         1308       3  ...  B57 B59 B63 B66        S
417         1309       3  ...  B57 B59 B63 B66        C

[417 rows x 11 columns]

# Sort

In [ ]:
df.sort_values(['Fare','Age'],ascending=False)

     PassengerId  Pclass  ...            Cabin Embarked
343         1235       1  ...      B51 B53 B55        C
69           961       1  ...      C23 C25 C27        S
53           945       1  ...      C23 C25 C27        S
142         1034       1  ...  B57 B59 B63 B66        C
24           916       1  ...  B57 B59 B63 B66        C
..           ...     ...  ...              ...      ...
133         1025       3  ...              NaN        C
21           913       3  ...              NaN        S
372         1264       1  ...      B52 B54 B56        S
266         1158       1  ...              NaN        S
152         1044       3  ...              NaN        S

[418 rows x 11 columns]

In [ ]:
df.head(20)

    PassengerId  Pclass  ... Cabin Embarked
0           892       3  ...   NaN        Q
1           893       3  ...   NaN        S
2           894       2  ...   NaN        Q
3           895       3  ...   NaN        S
4           896       3  ...   NaN        S
5           897       3  ...   NaN        S
6           898       3  ...   NaN        Q
7           899       2  ...   NaN        S
8           900       3  ...   NaN        C
9           901       3  ...   NaN        S
10          902       3  ...   NaN        S
11          903       1  ...   NaN        S
12          904       1  ...   B45        S
13          905       2  ...   NaN        S
14          906       1  ...   E31        S
15          907       2  ...   NaN        C
16          908       2  ...   NaN        Q
17          909       3  ...   NaN        C
18          910       3  ...   NaN        S
19          911       3  ...   NaN        C

[20 rows x 11 columns]

# Create column based on condition

In [ ]:
#Age 0-25- Young, 25-40- Mid age, 40-60- Mid high,60+ old

In [ ]:
#checking multiple conditions
def age(x):
  if (x <=25):
    return "Young"
  elif (x > 25) & (x<=40):
    return "Midage"
  elif (x>40) & (x<=60):
    return "MidHigh"
  else:
    return "Old"

df['Age_group'] = df['Age'].apply(lambda x: age(x))

In [ ]:
df.head()

   PassengerId  Pclass  ... Embarked Age_group
0          892       3  ...        Q    Midage
1          893       3  ...        S   MidHigh
2          894       2  ...        Q       Old
3          895       3  ...        S    Midage
4          896       3  ...        S     Young

[5 rows x 12 columns]

In [ ]:
#case of binomial output
df['Age1']= np.where(df['Age']<=45, 'Young','Old')

In [ ]:
df.head()

   PassengerId  Pclass  ... Age_group   Age1
0          892       3  ...    Midage  Young
1          893       3  ...   MidHigh    Old
2          894       2  ...       Old    Old
3          895       3  ...    Midage  Young
4          896       3  ...     Young  Young

[5 rows x 13 columns]

# Normalize

In [ ]:
data= np.array(df['Age'])
norm= data/np.linalg.norm(data)
df['Agenormed']= pd.DataFrame(norm)

In [ ]:
norm

array([0.05145049, 0.07009198, 0.09246176, 0.0402656 , 0.03280901,
       0.02087846, 0.04473956, 0.03877429, 0.02684374, 0.03131769,
       0.04514608, 0.06860066, 0.03430033, 0.09395308, 0.07009198,
       0.03579165, 0.05219615, 0.03131769, 0.0402656 , 0.06710934,
       0.08202253, 0.01342187, 0.04514608, 0.03131769, 0.0715833 ,
       0.07456593, 0.03280901, 0.03355467, 0.06114407, 0.04514608,
       0.07456593, 0.03579165, 0.04921352, 0.04514608, 0.04473956,
       0.0275894 , 0.04514608, 0.03131769, 0.03728297, 0.04514608,
       0.05816143, 0.04514608, 0.06114407, 0.04473956, 0.06710934,
       0.03728297, 0.06710934, 0.04514608, 0.08947912, 0.05368747,
       0.03579165, 0.0402656 , 0.02982637, 0.04175692, 0.04514608,
       0.01491319, 0.05219615, 0.03728297, 0.04514608, 0.05368747,
       0.02535242, 0.0477222 , 0.02684374, 0.03280901, 0.01938714,
       0.04514608, 0.02684374, 0.07009198, 0.04623088, 0.08947912,
       0.03579165, 0.03131769, 0.04324824, 0.04250258, 0.05219615,
       0.04846786, 0.04514608, 0.08202253, 0.04473956, 0.03579165,
       0.00894791, 0.09991835, 0.07307462, 0.04514608, 0.04514608,
       0.04514608, 0.0402656 , 0.02684374, 0.04514608, 0.00298264,
       0.03280901, 0.04514608, 0.0402656 , 0.04514608, 0.03728297,
       0.03728297, 0.11334022, 0.04324824, 0.02982637, 0.04921352,
       0.0641267 , 0.0402656 , 0.04514608, 0.03877429, 0.0238611 ,
       0.04175692, 0.03131769, 0.04514608, 0.04514608, 0.0275894 ,
       0.06114407, 0.04514608, 0.05368747, 0.0275894 , 0.09395308,
       0.02684374, 0.04514608, 0.00149132, 0.05368747, 0.04324824,
       0.01789582, 0.04514608, 0.05219615, 0.04175692, 0.04514608,
       0.02535242, 0.03280901, 0.04514608, 0.06263538, 0.03579165,
       0.0477222 , 0.07903989, 0.04514608, 0.04514608, 0.0641267 ,
       0.03579165, 0.03951994, 0.03877429, 0.03430033, 0.05965275,
       0.01491319, 0.04921352, 0.09097044, 0.04175692, 0.06263538,
       0.04623088, 0.04514608, 0.03280901, 0.04514608, 0.04473956,
       0.03430033, 0.04514608, 0.09022478, 0.05368747, 0.01938714,
       0.03579165, 0.04324824, 0.03430033, 0.06263538, 0.03877429,
       0.04514608, 0.01043923, 0.03877429, 0.04514608, 0.06114407,
       0.03877429, 0.0715833 , 0.02684374, 0.04514608, 0.03280901,
       0.04514608, 0.0402656 , 0.03430033, 0.04514608, 0.05965275,
       0.02236978, 0.02982637, 0.08053121, 0.05368747, 0.0954444 ,
       0.04473956, 0.05517879, 0.02684374, 0.04514608, 0.0402656 ,
       0.05965275, 0.03131769, 0.02535242, 0.04514608, 0.05965275,
       0.05070483, 0.04514608, 0.01715016, 0.09097044, 0.01193055,
       0.04921352, 0.00894791, 0.02684374, 0.03430033, 0.04514608,
       0.04514608, 0.00049214, 0.07009198, 0.01193055, 0.03728297,
       0.04514608, 0.05219615, 0.03579165, 0.04921352, 0.03728297,
       0.0477222 , 0.04514608, 0.02535242, 0.08947912, 0.05667011,
       0.06263538, 0.04514608, 0.08500516, 0.07456593, 0.04514608,
       0.04473956, 0.03131769, 0.03280901, 0.03131769, 0.07903989,
       0.04514608, 0.03430033, 0.04514608, 0.06039841, 0.05368747,
       0.02087846, 0.03131769, 0.03131769, 0.04514608, 0.05816143,
       0.02982637, 0.0954444 , 0.02982637, 0.02684374, 0.0715833 ,
       0.08202253, 0.06710934, 0.06710934, 0.04514608, 0.04514608,
       0.06114407, 0.03280901, 0.06263538, 0.04324824, 0.04514608,
       0.00137201, 0.02982637, 0.0402656 , 0.03579165, 0.04846786,
       0.04514608, 0.04514608, 0.04175692, 0.02833505, 0.03131769,
       0.05443313, 0.03131769, 0.04324824, 0.00149132, 0.04473956,
       0.04514608, 0.04514608, 0.04514608, 0.04514608, 0.02535242,
       0.06860066, 0.04514608, 0.03877429, 0.04514608, 0.04514608,
       0.02982637, 0.04175692, 0.05965275, 0.04473956, 0.03280901,
       0.03430033, 0.00111849, 0.04514608, 0.01342187, 0.00298264,
       0.05368747, 0.04514608, 0.03579165, 0.04514608, 0.04514608,
       0.04514608, 0.04473956, 0.04514608, 0.07903989, 0.05368747,
       0.03877429, 0.00149132, 0.04514608, 0.04473956, 0.04324824,
       0.0477222 , 0.04514608, 0.0641267 , 0.03579165, 0.04514608,
       0.0954444 , 0.04473956, 0.00123779, 0.08202253, 0.06710934,
       0.02684374, 0.03280901, 0.04514608, 0.05517879, 0.08202253,
       0.02535242, 0.08500516, 0.02833505, 0.0402656 , 0.03280901,
       0.03877429, 0.03728297, 0.03877429, 0.04921352, 0.05816143,
       0.03430033, 0.01789582, 0.06860066, 0.04324824, 0.03131769,
       0.0715833 , 0.05816143, 0.04514608, 0.02833505, 0.0402656 ,
       0.04473956, 0.0477222 , 0.05816143, 0.03728297, 0.04514608,
       0.02684374, 0.0477222 , 0.04514608, 0.08649648, 0.04514608,
       0.0238611 , 0.03877429, 0.05667011, 0.03579165, 0.04623088,
       0.06710934, 0.03728297, 0.02684374, 0.07307462, 0.00025352,
       0.07456593, 0.0879878 , 0.04514608, 0.04514608, 0.04473956,
       0.02162412, 0.03579165, 0.04623088, 0.0402656 , 0.03728297,
       0.04514608, 0.04514608, 0.03280901, 0.06710934, 0.04324824,
       0.03131769, 0.04623088, 0.07307462, 0.06561802, 0.08053121,
       0.06710934, 0.03280901, 0.03131769, 0.08202253, 0.00745659,
       0.04514608, 0.03877429, 0.04514608, 0.02833505, 0.04514608,
       0.03579165, 0.03579165, 0.08500516, 0.03131769, 0.00894791,
       0.03430033, 0.07605725, 0.01938714, 0.07009198, 0.04324824,
       0.02684374, 0.03579165, 0.0715833 , 0.03280901, 0.04623088,
       0.04473956, 0.05667011, 0.03280901, 0.02535242, 0.0641267 ,
       0.02982637, 0.03430033, 0.07456593, 0.04514608, 0.00447396,
       0.04514608, 0.05517879, 0.04175692, 0.04514608, 0.05816143,
       0.05741577, 0.04514608, 0.04514608])

In [ ]:
from numpy import asarray
x= df[['Age','Fare']].to_numpy()

numpy.ndarray

In [ ]:
from sklearn.preprocessing import MinMaxScaler
scaler= MinMaxScaler()
df[['Scaled12','Scaled21']]= scaler.fit_transform(df[['Age','Fare']])

In [ ]:
df.head()

   PassengerId  Pclass  ...  Scaled12  Scaled21
0          892       3  ...  0.452723  0.015282
1          893       3  ...  0.617566  0.013663
2          894       2  ...  0.815377  0.018909
3          895       3  ...  0.353818  0.016908
4          896       3  ...  0.287881  0.023984

[5 rows x 14 columns]